html/lc-8013-number-of-beautiful-integers-in-the-range.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LC 8013. 范围中美丽整数的数目</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">LC 8013. 范围中美丽整数的数目</h1>
<p>
<a href="https://leetcode.cn/problems/number-of-beautiful-integers-in-the-range/description/">https://leetcode.cn/problems/number-of-beautiful-integers-in-the-range/description/</a>
</p>

<p>
这次算是自己琢磨出来怎么写数位dp的，实现中有两个点，分别都是和isStart有关系的：
</p>
<ol class="org-ol">
<li>只有isStart=False,的时候，才可以继续以isStart=False递归下去，否则就要开始枚举具体数字了。</li>
<li>只有isStart=True的时候，才能枚举left被用于odd/even. 如果isStart=False,那么只能粗略判断(odd + left) &lt; even</li>
</ol>

<p>
然后就是这个状态中value必须取模k, 否则这个状态数量就太大了。
</p>

<div class="org-src-container">
<pre class="src src-Python">
class Solution:
    def numberOfBeautifulIntegers(self, low: int, high: int, k: int) -&gt; int:
        def OkOddEven(isStart, odd, even, left):
            if isStart:
                for x in range(0, left + 1):
                    if (odd + x) == (even + left - x):
                        return True
                return False
            else:
                if (odd + left) &lt; even or (even + left) &lt; odd:
                    return False
                return True

        def search(ss):
            import functools
            @functools.cache
            def f(i, isLimit, isStart, odd, even, value):
                # print(i, isLimit, isStart, odd, even, value)
                if i == len(ss):
                    if not isStart: return 0
                    if odd == even and value % k == 0:
                        # print(value)
                        return 1
                    return 0

                left = len(ss) - i
                if not OkOddEven(isStart, odd, even, left):
                    return 0

                ans = 0
                if not isStart:
                    ans += f(i + 1, True, False, odd, even, value)

                from_value = 1 if not isStart else 0
                to_value = int(ss[i]) if not isLimit else 9
                for x in range(from_value, to_value + 1):
                    ans += f(i + 1, isLimit or x &lt; int(ss[i]), isStart or x != 0,
                             odd + (x % 2), even + (x + 1) % 2,
                             # value * 10 + x)
                             (value * 10 + x) % k)
                return ans

            return f(0, False, False, 0, 0, 0)

        h = search(str(high))
        l = search(str(low - 1))
        ans = h - l
        return ans
</pre>
</div>
</div>
</body>
</html>
